# Теория

**Итерация** – это один полный проход (шаг) выполнения кода внутри цикла\
**Инкремент** – это операция увеличения значения переменной на 1
1. Префиксный (++i) – сначала увеличивает значение, потом использует его
2. Постфиксный (i++) – сначала использует значение, потом увеличивает его

### 1. `for`

Цикл `for` выполняет конкретное количество итераций

```csharp
for (инициализация; условие; итерация)
{
    // какой то код
}
```

Пример:

```csharp
for (int i = 0; i < 5; i++)
{
    Console.WriteLine($"i = {i}");
} 
```

Получим:

```
0
1
2
3
4
```

### 2. `while`

Цикл `while` выполняет блок кода, пока условие истино, или пока не будет использовано ключевое слово `break`, которое преждевременно завершит выполнение цикла (приминимо ко всем циклам)

```csharp
while (условие)
{
    // какой то код
}
```

Пример:

```csharp
int i = 0;

while (i < 5)
{
    Console.WriteLine($"i = {i}");
}
```

Также существует `do while` - он похож на `while`, но он всегда будет выполнять первую итерацию, и только потом проверит условие (то есть, `do while` гарантирует, что код будет выполнен хотя бы 1 раз)

```csharp
do
{
    // какой то код
} while (условие);
```

### 3. `foreach`

`foreach` используется для перебора элементов коллекции (например, массива) в "автоматическом режиме" 

```csharp
foreach (тип переменная in коллекция)
{
    // какой то код
}
```

Пример:

```csharp
int[] array = {1, 2, 3, 4, 5};

foreach (int num in array)
{
    Console.WriteLine("Число: " + num);
}
```

### Методы массивов

1. `Lenght` - Возвращает количество элементов в массиве

```csharp
int[] numbers = {1, 2, 3, 4, 5};
Console.WriteLine(numbers.Length); // 5
```

2. `Array.Sort()` - Сортирует массив по возрастанию

```csharp
int[] numbers = {5, 3, 8, 1, 4};
Array.Sort(numbers);
foreach (int num in numbers)
{
    Console.Write($"{num} ");
}   // 1 3 4 5 8
```

3. `Array.Reverse()` - Разворачивает массив

```csharp
int[] numbers = {1, 2, 3, 4, 5};
Array.Reverse(numbers);
foreach (int num in numbers)
{
    Console.Write($"{num} ");
}   // 5 4 3 2 1
```

4. `Array.IndexOf()` - Возвращает индекс первого вхождения элемента, иначе -1

```csharp
int[] numbers = {10, 20, 30, 40};
int index = Array.IndexOf(numbers, 30);
Console.WriteLine(index) // 2
```

5. `Array.LastIndexOf()` - Возвращает индекс последнего вхождения элемента, иначе -1

```csharp
int[] numbers = {10, 20, 30, 20, 40};
int lastIndex = Array.LastIndexOf(numbers, 20);
Console.WriteLine(lastIndex) // 3
```

# Задачи на циклы и массивы

**1. Сумма элементов массива**  
Напишите программу для вычисления суммы всех элементов в массиве целых чисел.

**2. Поиск максимального элемента**  
Создайте программу для нахождения максимального значения в массиве целых чисел.

**3. Обратный порядок массива**  
Напишите программу, которая переворачивает массив (последний элемент становится первым, и так далее).

**4. Четные числа в массиве**  
Создайте программу, которая выводит все четные числа из заданного массива.

**5. Подсчет отрицательных чисел**  
Напишите программу для подсчета количества отрицательных чисел в массиве.

**6. Линейный поиск**  
Реализуйте линейный поиск заданного элемента в массиве.

**7. Вывод элементов на нечетных позициях**  
Создайте программу для вывода элементов массива, которые находятся на нечетных позициях.

**8. Минимальное и максимальное значения**  
Напишите программу для нахождения минимального и максимального элементов в массиве.

**9. Сортировка массива**  
Реализуйте сортировку массива по возрастанию (любым методом сортировки).

**10. Замена элементов массива**  
Напишите программу, которая заменяет все отрицательные элементы в массиве нулями.

**11. Подмассив с Максимальной Суммой**  
Найти первый подмассив длиной N в массиве целых чисел, сумма элементов которого максимальна. Вывести подмассив.

**12. Сортировка и Анализ Уникальных Элементов**
Создать массив случайных чисел. Отсортировать массив по возрастанию, затем проанализировать его и найти количество уникальных элементов. Вывести отсортированный массив и количество уникальных элементов.

**13. Частотный Анализ**  
Проанализировать массив целых чисел и определить число, которое встречается чаще всего. Если таких чисел несколько, вывести их все вместе с количеством их появлений.

#### Практика А - решено 5/13 задач  
#### Практика B - решено 8/13 задач
#### Практика C - решено 11/13 задач